db/migrate/attachments/7-373-15-AirBookRQ2_OW.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
	<soap-env:Header>
		<Interface Version="2.0">
			<PayloadInfo RequestID="1234" TrackingId="1234567890" RequestorID="ECTEU">
				<CommDescriptor>
					<Authentication Username="admin" Password="MTTPower" />
				</CommDescriptor>
				<PayloadDescriptor Name="EXPE_AirBookRQ" Version="2">
				</PayloadDescriptor>
			</PayloadInfo>
		</Interface>
	</soap-env:Header>
	<soap-env:Body>
		<EXPE_AirBookRQ xmlns="http://www.travelapi.com/expe/gap/v1" TimeStamp="2001-12-17T09:30:47.0Z">
			<EchoInfo>String</EchoInfo>


      <GDS_Info GDS="PARTNERS">
        <CreditCardType>VI</CreditCardType>
      </GDS_Info>


      <MaxPrice Amount="1000" CurrencyCode="GBP"/>
			<AirItineraryInfo>
					<OriginDestinations>
					<OriginDestination OriginDestinationID="0">
						<FlightSegments>
							<FlightSegment SegmentID="0">
                <DepartureDateTime>2007-07-07T17:45:00.0Z</DepartureDateTime>
                <ArrivalDateTime>2007-07-07T19:25:00.0Z</ArrivalDateTime>
                <DepartureAirport LocationCode="HAM"/>
                <ArrivalAirport LocationCode="GVA"/>
                <MarketingAirline FlightNumber="1302" Code="U2"/>


              </FlightSegment>
						    </FlightSegments>
          </OriginDestination>
         
                  
					</OriginDestinations>

				
      </AirItineraryInfo>
			<TravelerInfo>
				<AirTraveler BirthDate="1979-12-26" AccompaniedByInfant="false" PassengerTypeCode="ADT">
          
          
          <PersonName NamePrefix="Mrs" GivenName="Charu" Surname="Thadani" MiddleName="Navin"/>
        </AirTraveler>         
			</TravelerInfo>

      <CreditCardInfo Type="VI" Number="4111111111111111" ExpirationMonth="10" ExpirationYear="2008" CCV="123"/>
      <ContactAddress>
      
                              <AddressLine>123</AddressLine>
      
                              <CityName>Bellevue</CityName>
      
                              <PostalCode>98052</PostalCode>
      
                              <StateProv>WA</StateProv>
      
                              <CountryName>US</CountryName>
      
                              <PhoneNumber>12134345</PhoneNumber>
      
                  </ContactAddress>
      		
		</EXPE_AirBookRQ>
	</soap-env:Body>
</soap-env:Envelope>
	


